In [1]:
import numpy as np
import pandas as pd

# Finding individual averages of batsmen

In [3]:
#load data file
data = pd.read_csv('F:/8TH SEM/CO425-FYP/England/England.csv')

In [4]:
data.head()

,InnigsID,dn,country,p1,p1-s,p2,p2-s,p3,p3-s,p4,...,p7,p7-s,p8,p8-s,p9,p9-s,p10,p10-s,p11,p11-s
0,1022,DN,England,IR Bell,0,MM Ali,22,JWA Taylor,0,JE Root,...,JC Buttler,28,CR Woakes,8,CJ Jordan,17,SCJ Broad,0,ST Finn,0
1,1033,DN,England,IR Bell,88,MM Ali,8,JWA Taylor,56,JE Root,...,JC Buttler,0,CR Woakes,0,SCJ Broad,0,JM Anderson,0,ST Finn,0
2,1040,DN,England,MM Ali,46,IR Bell,141,JWA Taylor,5,JE Root,...,RS Bopara,7,CR Woakes,0,SCJ Broad,0,JM Anderson,0,ST Finn,0
3,1049,D,England,IR Bell,10,MM Ali,17,JWA Taylor,82,JE Root,...,JC Buttler,67,CR Woakes,4,SCJ Broad,3,JM Anderson,0,ST Finn,0
4,1054,D,England,MM Ali,26,IR Bell,8,JWA Taylor,4,JE Root,...,JC Buttler,17,CR Woakes,0,SCJ Broad,24,ST Finn,6,JM Anderson,5

In [5]:
players = ['p1','p2','p3','p4','p5','p6','p7','p8','p9','p10','p11']
player_scores = ['p1-s','p2-s','p3-s','p4-s','p5-s','p6-s','p7-s','p8-s','p9-s','p10-s','p11-s']

In [6]:
x = set()

In [7]:
# finding unique players
for i in players:
    for j in range(len(data[i].unique())):
        x.add(data[i].unique()[j])

In [8]:
print(x)

{'MW Parkinson', 'JC Buttler', 'JC Tredwell', 'JL Denly', 'AU Rashid', 'ST Finn', 'TK Curran', 'S Mahmood', 'RJW Topley', 'MA Wood', 'LE Plunkett', 'MM Ali', 'TS Roland-Jones', 'T Banton', 'IR Bell', 'CR Woakes', 'BM Duckett', 'SW Billings', 'JM Bairstow', 'C Overton', 'OP Stone', 'SM Curran', 'DJ Malan', 'BA Stokes', 'JC Archer', 'RS Bopara', 'BT Foakes', 'JE Root', 'JT Ball', 'JWA Taylor', 'JJ Roy', 'JM Vince', 'AD Hales', 'SCJ Broad', 'DJ Willey', 'EJG Morgan', 'JM Anderson', 'CJ Jordan', 'GS Ballance', 'LA Dawson'}

In [9]:
len(x)

40

In [10]:
#set -> list
unique_list = list(x)
print(unique_list)

['MW Parkinson', 'JC Buttler', 'JC Tredwell', 'JL Denly', 'AU Rashid', 'ST Finn', 'TK Curran', 'S Mahmood', 'RJW Topley', 'MA Wood', 'LE Plunkett', 'MM Ali', 'TS Roland-Jones', 'T Banton', 'IR Bell', 'CR Woakes', 'BM Duckett', 'SW Billings', 'JM Bairstow', 'C Overton', 'OP Stone', 'SM Curran', 'DJ Malan', 'BA Stokes', 'JC Archer', 'RS Bopara', 'BT Foakes', 'JE Root', 'JT Ball', 'JWA Taylor', 'JJ Roy', 'JM Vince', 'AD Hales', 'SCJ Broad', 'DJ Willey', 'EJG Morgan', 'JM Anderson', 'CJ Jordan', 'GS Ballance', 'LA Dawson']

In [11]:
column_names = ["player_name", "sum", "avg"]

result = pd.DataFrame(columns = column_names)

In [12]:
# finding the individual averages of players=> total score/no.of matches played
dictionary = dict()

for indx, name in enumerate(unique_list):
    count = 0
    sum = 0
    for index, row in data.iterrows():
        for ind, p in enumerate(players):
                if(data.iloc[index][p] == name ):
#                     print(name)
                    sum = sum + data.iloc[index][player_scores[ind]] 
                    count += 1
    avg = round((sum/count),2)
    print(name," : sum=",sum," , count=",count," , average=",round(avg,2))    
    dictionary[name] = avg
    result = result.append({'player_name':name, 'sum':sum, 'avg':avg}, ignore_index=True)
    
print(dictionary)

MW Parkinson  : sum= 0  , count= 1  , average= 0.0
JC Buttler  : sum= 2677  , count= 93  , average= 28.78
JC Tredwell  : sum= 0  , count= 1  , average= 0.0
JL Denly  : sum= 178  , count= 5  , average= 35.6
AU Rashid  : sum= 579  , count= 92  , average= 6.29
ST Finn  : sum= 29  , count= 20  , average= 1.45
TK Curran  : sum= 292  , count= 23  , average= 12.7
S Mahmood  : sum= 12  , count= 4  , average= 3.0
RJW Topley  : sum= 7  , count= 11  , average= 0.64
MA Wood  : sum= 55  , count= 49  , average= 1.12
LE Plunkett  : sum= 252  , count= 53  , average= 4.75
MM Ali  : sum= 1188  , count= 88  , average= 13.5
TS Roland-Jones  : sum= 37  , count= 1  , average= 37.0
T Banton  : sum= 134  , count= 5  , average= 26.8
IR Bell  : sum= 455  , count= 10  , average= 45.5
CR Woakes  : sum= 919  , count= 71  , average= 12.94
BM Duckett  : sum= 123  , count= 3  , average= 41.0
SW Billings  : sum= 574  , count= 20  , average= 28.7
JM Bairstow  : sum= 2910  , count= 66  , average= 44.09
C Overton  : sum= 0  , count= 1  , average= 0.0
OP Stone  : sum= 9  , count= 3  , average= 3.0
SM Curran  : sum= 25  , count= 4  , average= 6.25
DJ Malan  : sum= 24  , count= 1  , average= 24.0
BA Stokes  : sum= 2316  , count= 67  , average= 34.57
JC Archer  : sum= 27  , count= 15  , average= 1.8
RS Bopara  : sum= 57  , count= 6  , average= 9.5
BT Foakes  : sum= 61  , count= 1  , average= 61.0
JE Root  : sum= 4389  , count= 96  , average= 45.72
JT Ball  : sum= 38  , count= 18  , average= 2.11
JWA Taylor  : sum= 674  , count= 19  , average= 35.47
JJ Roy  : sum= 3400  , count= 85  , average= 40.0
JM Vince  : sum= 322  , count= 14  , average= 23.0
AD Hales  : sum= 2227  , count= 57  , average= 39.07
SCJ Broad  : sum= 59  , count= 12  , average= 4.92
DJ Willey  : sum= 363  , count= 44  , average= 8.25
EJG Morgan  : sum= 3741  , count= 102  , average= 36.68
JM Anderson  : sum= 14  , count= 9  , average= 1.56
CJ Jordan  : sum= 55  , count= 13  , average= 4.23
GS Ballance  : sum= 26  , count= 3  , average= 8.67
LA Dawson  : sum= 14  , count= 2  , average= 7.0
{'MW Parkinson': 0.0, 'JC Buttler': 28.78, 'JC Tredwell': 0.0, 'JL Denly': 35.6, 'AU Rashid': 6.29, 'ST Finn': 1.45, 'TK Curran': 12.7, 'S Mahmood': 3.0, 'RJW Topley': 0.64, 'MA Wood': 1.12, 'LE Plunkett': 4.75, 'MM Ali': 13.5, 'TS Roland-Jones': 37.0, 'T Banton': 26.8, 'IR Bell': 45.5, 'CR Woakes': 12.94, 'BM Duckett': 41.0, 'SW Billings': 28.7, 'JM Bairstow': 44.09, 'C Overton': 0.0, 'OP Stone': 3.0, 'SM Curran': 6.25, 'DJ Malan': 24.0, 'BA Stokes': 34.57, 'JC Archer': 1.8, 'RS Bopara': 9.5, 'BT Foakes': 61.0, 'JE Root': 45.72, 'JT Ball': 2.11, 'JWA Taylor': 35.47, 'JJ Roy': 40.0, 'JM Vince': 23.0, 'AD Hales': 39.07, 'SCJ Broad': 4.92, 'DJ Willey': 8.25, 'EJG Morgan': 36.68, 'JM Anderson': 1.56, 'CJ Jordan': 4.23, 'GS Ballance': 8.67, 'LA Dawson': 7.0}

In [13]:
result.head(13)

        player_name   sum    avg
0      MW Parkinson     0   0.00
1        JC Buttler  2677  28.78
2       JC Tredwell     0   0.00
3          JL Denly   178  35.60
4         AU Rashid   579   6.29
5           ST Finn    29   1.45
6         TK Curran   292  12.70
7         S Mahmood    12   3.00
8        RJW Topley     7   0.64
9           MA Wood    55   1.12
10      LE Plunkett   252   4.75
11           MM Ali  1188  13.50
12  TS Roland-Jones    37  37.00

In [14]:
result.to_csv('F:/8TH SEM/CO425-FYP/England/indv_results/England_ind.csv',sep=',')

# 2 grams - combinational averages Vs sum of individual averages

In [15]:
#load data file-combinational avgs of 2-grams
data2grams = pd.read_csv('F:/8TH SEM/CO425-FYP/England/Combined averages/England_2g.csv',sep=',')

In [16]:
data2grams.head()

   Unnamed: 0     player-1  player-2    avg
0           0    TK Curran  JM Vince  56.00
1           1  SW Billings  JM Vince  70.75
2           2  LE Plunkett  JM Vince  34.25
3           3     JL Denly  JM Vince  43.00
4           4    C Overton  JM Vince   0.00

In [17]:
data2grams = data2grams[data2grams.avg != 0.0]

In [18]:
data2grams.head()

   Unnamed: 0     player-1  player-2     avg
0           0    TK Curran  JM Vince  56.000
1           1  SW Billings  JM Vince  70.750
2           2  LE Plunkett  JM Vince  34.250
3           3     JL Denly  JM Vince  43.000
7           7     JM Vince   JE Root  85.625

In [19]:
data2grams.shape

(413, 4)

In [20]:
data2grams = data2grams.reset_index(drop=True)

In [21]:
data2grams.head()

   Unnamed: 0     player-1  player-2     avg
0           0    TK Curran  JM Vince  56.000
1           1  SW Billings  JM Vince  70.750
2           2  LE Plunkett  JM Vince  34.250
3           3     JL Denly  JM Vince  43.000
4           7     JM Vince   JE Root  85.625

In [22]:
new_column_names = ["player-1", "player-2", "combined_avg","sum_of_individual"]

comparison_2grams = pd.DataFrame(columns = new_column_names)

In [23]:
for index, row in data2grams.iterrows():
    player1 = data2grams.iloc[index]['player-1']
    player2 = data2grams.iloc[index]['player-2']
    combined = data2grams.iloc[index]['avg']
    individual_avg_sum = dictionary.get(player1)+dictionary.get(player2)
    if(combined > individual_avg_sum):
        comparison_2grams = comparison_2grams.append({'player-1':player1, 'player-2':player2, 'combined_avg': combined, 'sum_of_individual':individual_avg_sum}, ignore_index=True)

In [24]:
comparison_2grams.head()

      player-1  player-2  combined_avg  sum_of_individual
0    TK Curran  JM Vince        56.000              35.70
1  SW Billings  JM Vince        70.750              51.70
2  LE Plunkett  JM Vince        34.250              27.75
3     JM Vince   JE Root        85.625              68.72
4    CJ Jordan  JM Vince        51.000              27.23

In [25]:
comparison_2grams.shape

(194, 4)

In [26]:
comparison_2grams.to_csv('F:/8TH SEM/CO425-FYP/England/Comparative analysis/England_comparison_2grams.csv')

# 3 grams - combinational averages Vs sum of individual averages

In [27]:
#load data file-combinational avgs of 3-grams
data3grams = pd.read_csv('F:/8TH SEM/CO425-FYP/England/Combined averages/England_3g.csv',sep=',')

In [28]:
data3grams.head()

   Unnamed: 0     player-1     player-2     player-3  avg
0           0  SW Billings    SCJ Broad  JC Tredwell  0.0
1           1  SW Billings  JC Tredwell  LE Plunkett  0.0
2           2  SW Billings  JC Tredwell  JM Bairstow  0.0
3           3  SW Billings    JC Archer  JC Tredwell  0.0
4           4  SW Billings     JL Denly  JC Tredwell  0.0

In [30]:
data3grams.shape

(9880, 5)

In [31]:
data3grams = data3grams[data3grams.avg != 0.0]

In [32]:
data3grams.shape

(2178, 5)

In [33]:
data3grams = data3grams.reset_index(drop=True)

In [34]:
data3grams.head()

   Unnamed: 0     player-1     player-2     player-3         avg
0          75  SW Billings  JM Bairstow  LE Plunkett   70.571429
1          81  SW Billings       JJ Roy  LE Plunkett   67.000000
2          82  SW Billings      JE Root  LE Plunkett   61.444444
3          83  SW Billings   BM Duckett  LE Plunkett  125.000000
4          84  SW Billings    AU Rashid  LE Plunkett   34.900000

In [35]:
new_column_names = ["player-1", "player-2", "player-3", "combined_avg","sum_of_individual"]

comparison_3grams = pd.DataFrame(columns = new_column_names)

In [36]:
for index, row in data3grams.iterrows():
    player1 = data3grams.iloc[index]['player-1']
    player2 = data3grams.iloc[index]['player-2']
    player3 = data3grams.iloc[index]['player-3']
    combined = data3grams.iloc[index]['avg']
    individual_avg_sum = dictionary.get(player1)+dictionary.get(player2)+dictionary.get(player3)
    if(combined > individual_avg_sum):
        comparison_3grams = comparison_3grams.append({'player-1':player1, 'player-2':player2,'player-3':player3, 'combined_avg': combined, 'sum_of_individual':individual_avg_sum}, ignore_index=True)

In [37]:
comparison_3grams.head()

      player-1    player-2     player-3  combined_avg  sum_of_individual
0  SW Billings  BM Duckett  LE Plunkett    125.000000              74.45
1  SW Billings   CJ Jordan  LE Plunkett     38.500000              37.68
2  SW Billings   CR Woakes  LE Plunkett     56.200000              46.39
3  SW Billings    JM Vince  LE Plunkett     94.000000              56.45
4  SW Billings  JC Buttler  LE Plunkett     65.555556              62.23

In [38]:
comparison_3grams.shape

(993, 5)

In [39]:
comparison_3grams.to_csv('F:/8TH SEM/CO425-FYP/England/Comparative analysis/England_comparison_3grams.csv')

# 4 grams - combinational averages Vs sum of individual averages

In [40]:
#load data file-combinational avgs of 4-grams
data4grams = pd.read_csv('F:/8TH SEM/CO425-FYP/England/Combined averages/England_4g.csv',sep=',')

In [41]:
data4grams.head()

   Unnamed: 0         player-1   player-2    player-3    player-4  avg
0           0  TS Roland-Jones  DJ Willey   CR Woakes  JC Buttler  0.0
1           1  TS Roland-Jones  DJ Willey  JWA Taylor   CR Woakes  0.0
2           2  TS Roland-Jones  DJ Willey   CR Woakes   LA Dawson  0.0
3           3  TS Roland-Jones  DJ Willey   AU Rashid   CR Woakes  0.0
4           4  TS Roland-Jones  DJ Willey   CR Woakes  EJG Morgan  0.0

In [42]:
data4grams.shape

(91390, 6)

In [43]:
data4grams = data4grams[data4grams.avg != 0.0]

In [44]:
data4grams.shape

(6652, 6)

In [45]:
data4grams = data4grams.reset_index(drop=True)

In [46]:
data4grams.head()

   Unnamed: 0         player-1   player-2     player-3    player-4    avg
0          39  TS Roland-Jones  DJ Willey    AU Rashid  JC Buttler   67.0
1          40  TS Roland-Jones  DJ Willey   EJG Morgan  JC Buttler   75.0
2          51  TS Roland-Jones  DJ Willey  JM Bairstow  JC Buttler  118.0
3          52  TS Roland-Jones  DJ Willey      JT Ball  JC Buttler   74.0
4          54  TS Roland-Jones  DJ Willey     AD Hales  JC Buttler   68.0

In [47]:
new_column_names = ["player-1", "player-2", "player-3", "player-4", "combined_avg","sum_of_individual"]

comparison_4grams = pd.DataFrame(columns = new_column_names)

In [48]:
for index, row in data4grams.iterrows():
    player1 = data4grams.iloc[index]['player-1']
    player2 = data4grams.iloc[index]['player-2']
    player3 = data4grams.iloc[index]['player-3']
    player4 = data4grams.iloc[index]['player-4']
    combined = data4grams.iloc[index]['avg']
    individual_avg_sum = dictionary.get(player1)+dictionary.get(player2)+dictionary.get(player3)+dictionary.get(player4)
    if(combined > individual_avg_sum):
        comparison_4grams = comparison_4grams.append({'player-1':player1, 'player-2':player2,'player-3':player3, 'player-4':player4,'combined_avg': combined, 'sum_of_individual':individual_avg_sum}, ignore_index=True)

In [49]:
comparison_4grams.head()

,player-1,player-2,player-3,player-4,combined_avg,sum_of_individual
0,TS Roland-Jones,DJ Willey,JM Bairstow,AU Rashid,114.0,95.63
1,TS Roland-Jones,DJ Willey,AU Rashid,JT Ball,70.0,53.65
2,TS Roland-Jones,DJ Willey,AU Rashid,ST Finn,66.0,52.99
3,TS Roland-Jones,DJ Willey,JM Bairstow,JT Ball,121.0,91.45
4,TS Roland-Jones,DJ Willey,JM Bairstow,ST Finn,117.0,90.79

In [50]:
comparison_4grams.shape

(3019, 6)

In [51]:
comparison_4grams.to_csv('F:/8TH SEM/CO425-FYP/England/Comparative analysis/England_comparison_4grams.csv')